'''
Κρυπτογραφος - Αποκρυπτογραφος
'''
import time
message = ""
keyword = ""
string = ""

charNum = [913, 914, 915, 916, 917, 918, 919, 920, 921, 922, 923, 924, 925, 926, 927, 928, 929, 931, 932, 933, 934, 935, 936, 937]
charTable = { "Α" : 0, "Β" : 1, "Γ" : 2, "Δ" : 3, "Ε" : 4, "Ζ" : 5, "Η" : 6, "Θ" : 7, "Ι" : 8, "Κ" : 9, "Λ" : 10, "Μ" : 11, "Ν" : 12, "Ξ" : 13, "Ο" : 14, "Π" : 15, "Ρ" : 16, "Σ" : 17, "Τ" : 18, "Υ" : 19, "Φ" : 20, "Χ" : 21, "Ψ" : 22, "Ω" : 23}


keyword = input("Εισήγαγε το κλειδί που θα κωδικοποιήσει το μήνυμά σου σε μορφή ΜΟΝΟ ΜΕ ΚΕΦΑΛΑΙΑ ΧΩΡΙΣ ΚΕΝΑ:")
string = input("Εισήγαγε το κείμενο που θα κωδικοποιήσει το πρόγραμμα σε μορφή ΜΟΝΟ ΜΕ ΚΕΦΑΛΑΙΑ ΧΩΡΙΣ ΚΕΝΑ:\n")
i=0
for char in string:
    character = charTable[char] + charTable[keyword[i]]
    if character > 23:
        character -= 24
    message += chr(charNum[character])
    i+=1
    if i == len(keyword):
        i=0
print(message)		
time.sleep(15)